<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="2" name="encoder_attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="encoder_attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="encoder_attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="encoder_hidden_states" type="Parameter" version="opset1">
			<data shape="?,?,16" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="encoder_hidden_states" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model.decoder.layers.0.self_attn.v_proj.bias" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="0" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.decoder.layers.0.self_attn.v_proj.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.decoder.layer_norm.bias,model.decoder.layernorm_embedding.bias,model.decoder.layers.0.encoder_attn.k_proj.bias,model.decoder.layers.0.encoder_attn.out_proj.bias,model.decoder.layers.0.encoder_attn.q_proj.bias,model.decoder.layers.0.encoder_attn.v_proj.bias,model.decoder.layers.0.encoder_attn_layer_norm.bias,model.decoder.layers.0.fc2.bias,model.decoder.layers.0.final_layer_norm.bias,model.decoder.layers.0.self_attn.k_proj.bias,model.decoder.layers.0.self_attn.out_proj.bias,model.decoder.layers.0.self_attn.q_proj.bias,model.decoder.layers.0.self_attn.v_proj.bias,model.decoder.layers.0.self_attn_layer_norm.bias,model.decoder.layers.1.encoder_attn.k_proj.bias,model.decoder.layers.1.encoder_attn.out_proj.bias,model.decoder.layers.1.encoder_attn.q_proj.bias,model.decoder.layers.1.encoder_attn.v_proj.bias,model.decoder.layers.1.encoder_attn_layer_norm.bias,model.decoder.layers.1.fc2.bias,model.decoder.layers.1.final_layer_norm.bias,model.decoder.layers.1.self_attn.k_proj.bias,model.decoder.layers.1.self_attn.out_proj.bias,model.decoder.layers.1.self_attn.q_proj.bias,model.decoder.layers.1.self_attn.v_proj.bias,model.decoder.layers.1.self_attn_layer_norm.bias">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="onnx::MatMul_777" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16" offset="64" size="1024" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_777" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_777">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/model/decoder/layers.1/encoder_attn/v_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.1/encoder_attn/v_proj/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.1/encoder_attn/v_proj/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/model/decoder/layers.1/encoder_attn/v_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.1/encoder_attn/v_proj/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.1/encoder_attn/v_proj/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model.shared.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1030, 16" offset="1088" size="65920" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.shared.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.shared.weight">
					<dim>1030</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/model/decoder/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/model/decoder/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/Shape_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/model/decoder/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="11" name="Constant_4482257" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482257" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="/model/decoder/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Constant_1, /model/decoder/Gather_1, Constant_4482257" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="13" name="Constant_4482260" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482260" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/model/decoder/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Unsqueeze, Constant_4482260" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/model/decoder/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Concat, /model/decoder/Constant_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/model/decoder/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_4482270" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482270" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="/model/decoder/embed_tokens/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_tokens/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1030</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/decoder/embed_tokens/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/model/decoder/Constant_3" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="67032" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/model/decoder/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="20" name="/model/decoder/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model.decoder.embed_positions.weight" type="Const" version="opset1">
			<data element_type="f32" shape="102, 16" offset="67036" size="6528" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.decoder.embed_positions.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.decoder.embed_positions.weight">
					<dim>102</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model/decoder/embed_positions/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/embed_positions/Constant_output_0" />
			</output>
		</layer>
		<layer id="23" name="/model/decoder/embed_positions/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/embed_positions/Cast_output_0" />
			</output>
		</layer>
		<layer id="24" name="/model/decoder/embed_positions/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/embed_positions/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="25" name="/model/decoder/embed_positions/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Range" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/embed_positions/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/model/decoder/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/model/decoder/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/Constant_output_0" />
			</output>
		</layer>
		<layer id="28" name="Constant_4482253" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482253" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="29" name="/model/decoder/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Constant, /model/decoder/Gather, Constant_4482253" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/Gather_output_0" />
			</output>
		</layer>
		<layer id="30" name="Constant_4482529" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482529" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model/decoder/embed_positions/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Unsqueeze, Constant_4482529" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/embed_positions/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model/decoder/embed_positions/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/embed_positions/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/model/decoder/embed_positions/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Concat, /model/decoder/embed_positions/Constant_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/embed_positions/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_4491579" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Reshape" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model/decoder/embed_positions/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/embed_positions/Reshape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_4482539" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482539" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="37" name="/model/decoder/embed_positions/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/embed_positions/Shape_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/model/decoder/embed_positions/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/ConstantOfShape, Constant_4482539" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/embed_positions/ConstantOfShape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model/decoder/embed_positions/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/embed_positions/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="40" name="/model/decoder/embed_positions/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Constant_4, /model/decoder/embed_positions/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/embed_positions/Mul_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model/decoder/embed_positions/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Equal" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/model/decoder/embed_positions/Equal_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model/decoder/embed_positions/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Where" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/embed_positions/Where_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/model/decoder/embed_positions/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Expand" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/embed_positions/Expand_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model/decoder/embed_positions/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="73564" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/embed_positions/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="45" name="/model/decoder/embed_positions/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Add" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/embed_positions/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_4482592" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482592" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="47" name="/model/decoder/embed_positions/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/embed_positions/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>102</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/decoder/embed_positions/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/model/decoder/Cast_6" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Cast_6" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/decoder/Cast_6_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/model/decoder/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_4482596" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482596" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/model/decoder/layernorm_embedding/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layernorm_embedding/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/model/decoder/layernorm_embedding/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layernorm_embedding/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model/decoder/layernorm_embedding/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="73572" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/model/decoder/layernorm_embedding/Constant_output_0" />
			</output>
		</layer>
		<layer id="54" name="/model/decoder/layernorm_embedding/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layernorm_embedding/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_4482601" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482601" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model/decoder/layernorm_embedding/ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/ReduceMean_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layernorm_embedding/ReduceMean_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/model/decoder/layernorm_embedding/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="73576" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/model/decoder/layernorm_embedding/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="58" name="/model/decoder/layernorm_embedding/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layernorm_embedding/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/model/decoder/layernorm_embedding/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/decoder/layernorm_embedding/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model/decoder/layernorm_embedding/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layernorm_embedding/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model.decoder.layers.0.encoder_attn_layer_norm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="73580" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.decoder.layers.0.encoder_attn_layer_norm.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.decoder.layer_norm.weight,model.decoder.layernorm_embedding.weight,model.decoder.layers.0.encoder_attn_layer_norm.weight,model.decoder.layers.0.final_layer_norm.weight,model.decoder.layers.0.self_attn_layer_norm.weight,model.decoder.layers.1.encoder_attn_layer_norm.weight,model.decoder.layers.1.final_layer_norm.weight,model.decoder.layers.1.self_attn_layer_norm.weight">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/model/decoder/layernorm_embedding/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layernorm_embedding/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model/decoder/layernorm_embedding/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layernorm_embedding/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layernorm_embedding/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_4482609" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482609" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/model/decoder/layers.0/self_attn_layer_norm/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model/decoder/layers.0/self_attn_layer_norm/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/model/decoder/layers.0/self_attn_layer_norm/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="73572" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Constant_output_0" />
			</output>
		</layer>
		<layer id="68" name="/model/decoder/layers.0/self_attn_layer_norm/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_4482614" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482614" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/model/decoder/layers.0/self_attn_layer_norm/ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/ReduceMean_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/ReduceMean_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model/decoder/layers.0/self_attn_layer_norm/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="73576" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="72" name="/model/decoder/layers.0/self_attn_layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/model/decoder/layers.0/self_attn_layer_norm/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model/decoder/layers.0/self_attn_layer_norm/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/model/decoder/layers.0/self_attn_layer_norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model/decoder/layers.0/self_attn_layer_norm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn_layer_norm/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn_layer_norm/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="onnx::MatMul_701" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16" offset="73644" size="1024" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_701" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_701">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/model/decoder/layers.0/self_attn/q_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/q_proj/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/q_proj/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model/decoder/layers.0/self_attn/q_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/q_proj/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/q_proj/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/model/decoder/layers.0/self_attn/Constant_2" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="74668" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/model/decoder/layers.0/self_attn/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="81" name="/model/decoder/layers.0/self_attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/decoder/layers.0/self_attn/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/model/decoder/layers.0/self_attn/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/layers.0/self_attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/model/decoder/layers.0/self_attn/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_output_0" />
			</output>
		</layer>
		<layer id="84" name="Constant_4482624" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482624" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="85" name="/model/decoder/layers.0/self_attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Constant, /model/decoder/layers.0/self_attn/Gather, Constant_4482624" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/layers.0/self_attn/Gather_output_0" />
			</output>
		</layer>
		<layer id="86" name="Constant_4482670" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482670" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/model/decoder/layers.0/self_attn/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Unsqueeze_2, Constant_4482670" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/layers.0/self_attn/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model/decoder/layers.0/self_attn/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/decoder/layers.0/self_attn/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/model/decoder/layers.0/self_attn/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="90" name="Constant_4482628" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482628" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="91" name="/model/decoder/layers.0/self_attn/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Constant_1, /model/decoder/layers.0/self_attn/Gather_1, Constant_4482628" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/decoder/layers.0/self_attn/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="92" name="Constant_4482672" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67024" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4482672" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model/decoder/layers.0/self_attn/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Unsqueeze_3, Constant_4482672" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/decoder/layers.0/self_attn/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/model/decoder/layers.0/self_attn/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="74672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Constant_10" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/model/decoder/layers.0/self_attn/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="74672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Constant_11" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/decoder/layers.0/self_attn/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/model/decoder/layers.0/self_attn/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model/decoder/layers.0/self_attn/Concat_2, /model/decoder/layers.0/self_attn/Constant_10, /model/decoder/layers.0/self_attn/Constant_11" />
			</rt_info>
			<input>
