<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="embed_tokens.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1000, 16" offset="0" size="64000" />
			<rt_info>
				<attribute name="fused_names" version="0" value="embed_tokens.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="embed_tokens.weight">
					<dim>1000</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="6" name="Constant_4728928" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4728928" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="7" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant, /Gather, Constant_4728928" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_output_0" />
			</output>
		</layer>
		<layer id="8" name="Constant_4728931" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4728931" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/Unsqueeze, Constant_4728931" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Concat, /Constant_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_4728941" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4728941" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="/embed_tokens/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_tokens/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1000</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/embed_tokens/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/Constant_2" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="64024" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="15" name="/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="embed_positions.weight" type="Const" version="opset1">
			<data element_type="f32" shape="102, 16" offset="64028" size="6528" />
			<rt_info>
				<attribute name="fused_names" version="0" value="embed_positions.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="embed_positions.weight">
					<dim>102</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/embed_positions/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/embed_positions/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="18" name="/embed_positions/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="/embed_positions/Cast_output_0" />
			</output>
		</layer>
		<layer id="19" name="/embed_positions/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/embed_positions/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="20" name="/embed_positions/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Range" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/embed_positions/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/embed_positions/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/embed_positions/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/embed_positions/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/embed_positions/Constant_output_0" />
			</output>
		</layer>
		<layer id="23" name="Constant_4728947" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4728947" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="24" name="/embed_positions/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Constant, /embed_positions/Gather, Constant_4728947" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/embed_positions/Gather_output_0" />
			</output>
		</layer>
		<layer id="25" name="Constant_4728965" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4728965" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/embed_positions/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Unsqueeze, Constant_4728965" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/embed_positions/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/embed_positions/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/embed_positions/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/embed_positions/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Concat, /embed_positions/Constant_3" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/embed_positions/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_4734888" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Reshape" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/embed_positions/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/embed_positions/Reshape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_4728975" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4728975" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="32" name="/embed_positions/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/embed_positions/Shape_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/embed_positions/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/ConstantOfShape, Constant_4728975" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/embed_positions/ConstantOfShape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/embed_positions/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/embed_positions/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="35" name="/embed_positions/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Constant_5, /embed_positions/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/embed_positions/Mul_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/embed_positions/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Equal" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/embed_positions/Equal_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/embed_positions/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Where" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/embed_positions/Where_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/embed_positions/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Expand" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/embed_positions/Expand_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/embed_positions/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="70556" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/embed_positions/Constant_6_output_0" />
			</output>
		</layer>
		<layer id="40" name="/embed_positions/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Add" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/embed_positions/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_4729028" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729028" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="42" name="/embed_positions/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_positions/Gather_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>102</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/embed_positions/Gather_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_4729032" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729032" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/layernorm_embedding/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layernorm_embedding/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/layernorm_embedding/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layernorm_embedding/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/layernorm_embedding/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="70564" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/layernorm_embedding/Constant_output_0" />
			</output>
		</layer>
		<layer id="49" name="/layernorm_embedding/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/layernorm_embedding/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_4729037" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729037" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/layernorm_embedding/ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/ReduceMean_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layernorm_embedding/ReduceMean_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/layernorm_embedding/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="70568" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/layernorm_embedding/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="53" name="/layernorm_embedding/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/layernorm_embedding/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/layernorm_embedding/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/layernorm_embedding/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/layernorm_embedding/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layernorm_embedding/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="layers.0.final_layer_norm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="70572" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="layers.0.final_layer_norm.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="layernorm_embedding.weight,layers.0.final_layer_norm.weight,layers.0.self_attn_layer_norm.weight,layers.1.final_layer_norm.weight,layers.1.self_attn_layer_norm.weight">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/layernorm_embedding/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layernorm_embedding/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="layers.0.self_attn.v_proj.bias" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="70636" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="layers.0.self_attn.v_proj.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="layernorm_embedding.bias,layers.0.fc2.bias,layers.0.final_layer_norm.bias,layers.0.self_attn.k_proj.bias,layers.0.self_attn.out_proj.bias,layers.0.self_attn.q_proj.bias,layers.0.self_attn.v_proj.bias,layers.0.self_attn_layer_norm.bias,layers.1.fc2.bias,layers.1.final_layer_norm.bias,layers.1.self_attn.k_proj.bias,layers.1.self_attn.out_proj.bias,layers.1.self_attn.q_proj.bias,layers.1.self_attn.v_proj.bias,layers.1.self_attn_layer_norm.bias">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/layernorm_embedding/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layernorm_embedding/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layernorm_embedding/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="onnx::MatMul_375" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16" offset="70700" size="1024" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_375" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_375">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/layers.0/self_attn/q_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/q_proj/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/q_proj/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/layers.0/self_attn/q_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/q_proj/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/q_proj/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/layers.0/self_attn/Constant_2" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="71724" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/layers.0/self_attn/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="64" name="/layers.0/self_attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/layers.0/self_attn/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/layers.0/self_attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/layers.0/self_attn/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_output_0" />
			</output>
		</layer>
		<layer id="67" name="Constant_4729135" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729135" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="68" name="/layers.0/self_attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant, /layers.0/self_attn/Gather, Constant_4729135" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/layers.0/self_attn/Gather_output_0" />
			</output>
		</layer>
		<layer id="69" name="Constant_4729181" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729181" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/layers.0/self_attn/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Unsqueeze_2, Constant_4729181" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layers.0/self_attn/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/layers.0/self_attn/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/layers.0/self_attn/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/layers.0/self_attn/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64008" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="73" name="Constant_4729139" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729139" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="74" name="/layers.0/self_attn/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_1, /layers.0/self_attn/Gather_1, Constant_4729139" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/layers.0/self_attn/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="75" name="Constant_4729183" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729183" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/layers.0/self_attn/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Unsqueeze_3, Constant_4729183" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layers.0/self_attn/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/layers.0/self_attn/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="71728" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_10" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/layers.0/self_attn/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="71728" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_11" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/layers.0/self_attn/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Concat_2, /layers.0/self_attn/Constant_10, /layers.0/self_attn/Constant_11" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/layers.0/self_attn/Concat_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/layers.0/self_attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Reshape_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/Reshape_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_4729199" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="71736" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729199" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/layers.0/self_attn/Transpose_2" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Transpose_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/layers.0/self_attn/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="71728" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_9" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_9_output_0" />
			</output>
		</layer>
		<layer id="84" name="/layers.0/self_attn/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_9, /layers.0/self_attn/Mul_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/layers.0/self_attn/Mul_1_output_0" />
			</output>
		</layer>
		<layer id="85" name="Constant_4729201" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729201" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/layers.0/self_attn/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Unsqueeze_4, Constant_4729201" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layers.0/self_attn/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/layers.0/self_attn/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_12" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/layers.0/self_attn/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="71728" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_13" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/layers.0/self_attn/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Concat_3, /layers.0/self_attn/Constant_12, /layers.0/self_attn/Constant_13" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/layers.0/self_attn/Concat_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/layers.0/self_attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Reshape_3" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/Reshape_3_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx::MatMul_376" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16" offset="71768" size="1024" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_376" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_376">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/layers.0/self_attn/k_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/k_proj/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/k_proj/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/layers.0/self_attn/k_proj/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/k_proj/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/k_proj/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_4729147" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729147" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/layers.0/self_attn/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Unsqueeze, Constant_4729147" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layers.0/self_attn/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/layers.0/self_attn/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/layers.0/self_attn/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="71728" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/layers.0/self_attn/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="71728" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/layers.0/self_attn/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Concat, /layers.0/self_attn/Constant_3, /layers.0/self_attn/Constant_4, /layers.0/self_attn/Constant_5" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/layers.0/self_attn/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/layers.0/self_attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_4729166" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="71736" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729166" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/layers.0/self_attn/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Transpose" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layers.0/self_attn/Transpose_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_4729206" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64016" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4729206" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/layers.0/self_attn/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Unsqueeze_5, Constant_4729206" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/layers.0/self_attn/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/layers.0/self_attn/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64000" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/layers.0/self_attn/Constant_14" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/layers.0/self_attn/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/layers.0/self_attn/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="71728" size="8" />
			<rt_info>
