<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="22" name="encoder_attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="encoder_attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="encoder_attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="encoder_hidden_states" type="Parameter" version="opset1">
			<data shape="?,?,32" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="encoder_hidden_states" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="past_key_values.0.decoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.0.decoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.decoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="past_key_values.0.decoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.0.decoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.decoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="past_key_values.0.encoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.0.encoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.encoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="past_key_values.0.encoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.0.encoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.encoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="past_key_values.1.decoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.1.decoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.decoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="past_key_values.1.decoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.1.decoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.decoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="past_key_values.1.encoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.1.encoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.encoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="past_key_values.1.encoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.1.encoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.encoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="past_key_values.2.decoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.2.decoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.decoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="past_key_values.2.decoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.2.decoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.decoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="past_key_values.2.encoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.2.encoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.encoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="past_key_values.2.encoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.2.encoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.encoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="past_key_values.3.decoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.3.decoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.decoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="past_key_values.3.decoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.3.decoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.decoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="past_key_values.3.encoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.3.encoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.encoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="past_key_values.3.encoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.3.encoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.encoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="past_key_values.4.decoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.4.decoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.decoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="past_key_values.4.decoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.4.decoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.decoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="past_key_values.4.encoder.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.4.encoder.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.encoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="past_key_values.4.encoder.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.4.encoder.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.encoder.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="decoder.block.0.layer.1.layer_norm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="0" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="decoder.block.0.layer.1.layer_norm.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="decoder.block.0.layer.0.layer_norm.weight,decoder.block.0.layer.1.layer_norm.weight,decoder.block.0.layer.2.layer_norm.weight,decoder.block.1.layer.0.layer_norm.weight,decoder.block.1.layer.1.layer_norm.weight,decoder.block.1.layer.2.layer_norm.weight,decoder.block.2.layer.0.layer_norm.weight,decoder.block.2.layer.1.layer_norm.weight,decoder.block.2.layer.2.layer_norm.weight,decoder.block.3.layer.0.layer_norm.weight,decoder.block.3.layer.1.layer_norm.weight,decoder.block.3.layer.2.layer_norm.weight,decoder.block.4.layer.0.layer_norm.weight,decoder.block.4.layer.1.layer_norm.weight,decoder.block.4.layer.2.layer_norm.weight,decoder.final_layer_norm.weight">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="shared.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1103, 32" offset="128" size="141184" />
			<rt_info>
				<attribute name="fused_names" version="0" value="shared.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="shared.weight">
					<dim>1103</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/decoder/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141312" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/decoder/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/Shape_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/decoder/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="28" name="Constant_4659794" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4659794" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="29" name="/decoder/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Constant_1, /decoder/Gather_1, Constant_4659794" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="30" name="Constant_22" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_22" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_143">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/decoder/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Unsqueeze, Constant_22" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/decoder/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Concat, /decoder/Constant_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/decoder/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_4659807" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4659807" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="/decoder/shared/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/shared/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1103</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/decoder/shared/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/decoder/block.0/layer.0/layer_norm/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/decoder/block.0/layer.0/layer_norm/Constant_2" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="141336" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="38" name="/decoder/block.0/layer.0/layer_norm/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="141340" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Constant_output_0" />
			</output>
		</layer>
		<layer id="39" name="/decoder/block.0/layer.0/layer_norm/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_4660078" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141312" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4660078" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/decoder/block.0/layer.0/layer_norm/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/decoder/block.0/layer.0/layer_norm/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="141344" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="43" name="/decoder/block.0/layer.0/layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/decoder/block.0/layer.0/layer_norm/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/decoder/block.0/layer.0/layer_norm/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/decoder/block.0/layer.0/layer_norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/decoder/block.0/layer.0/layer_norm/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Mul_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Mul_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="onnx::MatMul_1005" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="141348" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_1005" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_1005">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/decoder/block.0/layer.0/SelfAttention/q/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/q/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/q/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/decoder/block.0/layer.0/SelfAttention/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/decoder/block.0/layer.0/SelfAttention/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_output_0" />
			</output>
		</layer>
		<layer id="52" name="Constant_4660089" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4660089" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="53" name="/decoder/block.0/layer.0/SelfAttention/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant, /decoder/block.0/layer.0/SelfAttention/Gather, Constant_4660089" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Gather_output_0" />
			</output>
		</layer>
		<layer id="54" name="Constant_121" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_121" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_249">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/decoder/block.0/layer.0/SelfAttention/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Unsqueeze, Constant_121" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/decoder/block.0/layer.0/SelfAttention/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141312" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/decoder/block.0/layer.0/SelfAttention/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145444" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/decoder/block.0/layer.0/SelfAttention/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145452" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/decoder/block.0/layer.0/SelfAttention/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Concat, /decoder/block.0/layer.0/SelfAttention/Constant_2, /decoder/block.0/layer.0/SelfAttention/Constant_3, /decoder/block.0/layer.0/SelfAttention/Constant_4" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/decoder/block.0/layer.0/SelfAttention/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_4660122" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="145460" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4660122" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/decoder/block.0/layer.0/SelfAttention/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Transpose" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Transpose_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="onnx::MatMul_1015" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="145492" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_1015" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_1015">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/decoder/block.0/layer.0/SelfAttention/k/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/k/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/k/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_127" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_127" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_258">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_1, Constant_127" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/decoder/block.0/layer.0/SelfAttention/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141312" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/decoder/block.0/layer.0/SelfAttention/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145444" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/decoder/block.0/layer.0/SelfAttention/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145452" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_7" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/decoder/block.0/layer.0/SelfAttention/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Concat_1, /decoder/block.0/layer.0/SelfAttention/Constant_5, /decoder/block.0/layer.0/SelfAttention/Constant_6, /decoder/block.0/layer.0/SelfAttention/Constant_7" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/decoder/block.0/layer.0/SelfAttention/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Reshape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_4660132" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="145460" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4660132" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/decoder/block.0/layer.0/SelfAttention/Transpose_1" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Transpose_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Transpose_1_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="present.0.decoder.key" type="Concat" version="opset1">
			<data axis="2" />
			<rt_info>
				<attribute name="fused_names" version="0" value="present.0.decoder.key" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.decoder.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/decoder/block.0/layer.0/SelfAttention/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/MatMul, /decoder/block.0/layer.0/SelfAttention/Transpose_3" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/MatMul_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 4" offset="149588" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight">
					<dim>8</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/decoder/block.0/layer.0/SelfAttention/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_14" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_14_output_0" />
			</output>
		</layer>
		<layer id="78" name="/decoder/block.0/layer.0/SelfAttention/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/decoder/block.0/layer.0/SelfAttention/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="80" name="Constant_4660093" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4660093" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="81" name="/decoder/block.0/layer.0/SelfAttention/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_1, /decoder/block.0/layer.0/SelfAttention/Gather_1, Constant_4660093" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="82" name="/decoder/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Shape_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/Shape_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/decoder/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="149716" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="84" name="Constant_4659811" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4659811" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="85" name="/decoder/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Constant_3, /decoder/Gather_2, Constant_4659811" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/Gather_2_output_0" />
			</output>
		</layer>
		<layer id="86" name="/decoder/block.0/layer.0/SelfAttention/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Add" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Add_output_0" />
			</output>
		</layer>
		<layer id="87" name="/decoder/block.0/layer.0/SelfAttention/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Cast_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Cast_1_output_0" />
			</output>
		</layer>
		<layer id="88" name="/decoder/block.0/layer.0/SelfAttention/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_15" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_15_output_0" />
			</output>
		</layer>
		<layer id="89" name="/decoder/block.0/layer.0/SelfAttention/Range_1" type="Range" version="opset4">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Range_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Range_1_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/decoder/block.0/layer.0/SelfAttention/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_16" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_4" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_4_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/decoder/block.0/layer.0/SelfAttention/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_11" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_11_output_0" />
			</output>
		</layer>
		<layer id="93" name="/decoder/block.0/layer.0/SelfAttention/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Cast_output_0" />
			</output>
		</layer>
		<layer id="94" name="/decoder/block.0/layer.0/SelfAttention/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_12" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_12_output_0" />
			</output>
		</layer>
		<layer id="95" name="/decoder/block.0/layer.0/SelfAttention/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Range" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/decoder/block.0/layer.0/SelfAttention/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_13" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_3" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_3_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/decoder/block.0/layer.0/SelfAttention/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_4660308" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4660308" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="100" name="/decoder/block.0/layer.0/SelfAttention/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
