<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="block.0.layer.1.layer_norm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="0" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="block.0.layer.1.layer_norm.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="block.0.layer.0.layer_norm.weight,block.0.layer.1.layer_norm.weight,block.1.layer.0.layer_norm.weight,block.1.layer.1.layer_norm.weight,block.2.layer.0.layer_norm.weight,block.2.layer.1.layer_norm.weight,block.3.layer.0.layer_norm.weight,block.3.layer.1.layer_norm.weight,block.4.layer.0.layer_norm.weight,block.4.layer.1.layer_norm.weight,final_layer_norm.weight">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="embed_tokens.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1103, 32" offset="128" size="141184" />
			<rt_info>
				<attribute name="fused_names" version="0" value="embed_tokens.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="embed_tokens.weight">
					<dim>1103</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141312" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="7" name="Constant_4657839" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657839" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant, /Gather, Constant_4657839" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_output_0" />
			</output>
		</layer>
		<layer id="9" name="Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_14" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_51">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/Unsqueeze, Constant_14" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Concat, /Constant_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_4657852" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657852" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="/embed_tokens/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/embed_tokens/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1103</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/embed_tokens/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/block.0/layer.0/layer_norm/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/block.0/layer.0/layer_norm/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/block.0/layer.0/layer_norm/Constant_2" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="141336" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/block.0/layer.0/layer_norm/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="17" name="/block.0/layer.0/layer_norm/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="141340" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/block.0/layer.0/layer_norm/Constant_output_0" />
			</output>
		</layer>
		<layer id="18" name="/block.0/layer.0/layer_norm/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/layer_norm/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_4657866" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141312" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657866" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/block.0/layer.0/layer_norm/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/layer_norm/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/block.0/layer.0/layer_norm/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="141344" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/block.0/layer.0/layer_norm/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="22" name="/block.0/layer.0/layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/layer_norm/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/block.0/layer.0/layer_norm/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/block.0/layer.0/layer_norm/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/block.0/layer.0/layer_norm/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/layer_norm/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/block.0/layer.0/layer_norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/layer_norm/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/block.0/layer.0/layer_norm/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/layer_norm/Mul_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/layer_norm/Mul_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="onnx::MatMul_558" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="141348" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_558" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_558">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/block.0/layer.0/SelfAttention/q/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/q/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/q/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/block.0/layer.0/SelfAttention/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/block.0/layer.0/SelfAttention/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/block.0/layer.0/SelfAttention/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_output_0" />
			</output>
		</layer>
		<layer id="31" name="Constant_4657877" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657877" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="32" name="/block.0/layer.0/SelfAttention/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant, /block.0/layer.0/SelfAttention/Gather, Constant_4657877" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/block.0/layer.0/SelfAttention/Gather_output_0" />
			</output>
		</layer>
		<layer id="33" name="Constant_46" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_46" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_86">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/block.0/layer.0/SelfAttention/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Unsqueeze, Constant_46" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/block.0/layer.0/SelfAttention/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141312" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/block.0/layer.0/SelfAttention/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145444" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/block.0/layer.0/SelfAttention/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145452" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/block.0/layer.0/SelfAttention/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Concat, /block.0/layer.0/SelfAttention/Constant_2, /block.0/layer.0/SelfAttention/Constant_3, /block.0/layer.0/SelfAttention/Constant_4" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/block.0/layer.0/SelfAttention/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/block.0/layer.0/SelfAttention/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_4657909" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="145460" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657909" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/block.0/layer.0/SelfAttention/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Transpose" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/Transpose_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="onnx::MatMul_568" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="145492" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_568" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_568">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/block.0/layer.0/SelfAttention/k/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/k/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/k/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_52" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_52" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_95">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/block.0/layer.0/SelfAttention/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Unsqueeze_1, Constant_52" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/block.0/layer.0/SelfAttention/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141312" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/block.0/layer.0/SelfAttention/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145444" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/block.0/layer.0/SelfAttention/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145452" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_7" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/block.0/layer.0/SelfAttention/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Concat_1, /block.0/layer.0/SelfAttention/Constant_5, /block.0/layer.0/SelfAttention/Constant_6, /block.0/layer.0/SelfAttention/Constant_7" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/block.0/layer.0/SelfAttention/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/block.0/layer.0/SelfAttention/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Reshape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_4657929" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="149588" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657929" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/block.0/layer.0/SelfAttention/Transpose_2" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Transpose_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/block.0/layer.0/SelfAttention/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/MatMul_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="block.0.layer.0.SelfAttention.relative_attention_bias.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 4" offset="149620" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="block.0.layer.0.SelfAttention.relative_attention_bias.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="block.0.layer.0.SelfAttention.relative_attention_bias.weight">
					<dim>8</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/block.0/layer.0/SelfAttention/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_11" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_11_output_0" />
			</output>
		</layer>
		<layer id="56" name="/block.0/layer.0/SelfAttention/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/block.0/layer.0/SelfAttention/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/block.0/layer.0/SelfAttention/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="58" name="Constant_4657881" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657881" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="59" name="/block.0/layer.0/SelfAttention/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_1, /block.0/layer.0/SelfAttention/Gather_1, Constant_4657881" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/block.0/layer.0/SelfAttention/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="60" name="/block.0/layer.0/SelfAttention/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="/block.0/layer.0/SelfAttention/Cast_output_0" />
			</output>
		</layer>
		<layer id="61" name="/block.0/layer.0/SelfAttention/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_12" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_12_output_0" />
			</output>
		</layer>
		<layer id="62" name="/block.0/layer.0/SelfAttention/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Range" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/block.0/layer.0/SelfAttention/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/block.0/layer.0/SelfAttention/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_14" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/block.0/layer.0/SelfAttention/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Unsqueeze_4" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Unsqueeze_4_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/block.0/layer.0/SelfAttention/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141320" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_13" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/block.0/layer.0/SelfAttention/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Unsqueeze_3" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Unsqueeze_3_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/block.0/layer.0/SelfAttention/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/block.0/layer.0/SelfAttention/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_15" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_15_output_0" />
			</output>
		</layer>
		<layer id="69" name="/block.0/layer.0/SelfAttention/Greater" type="Greater" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Greater" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="/block.0/layer.0/SelfAttention/Greater_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/block.0/layer.0/SelfAttention/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Cast_1" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/block.0/layer.0/SelfAttention/Cast_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/block.0/layer.0/SelfAttention/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145444" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_16" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_16_output_0" />
			</output>
		</layer>
		<layer id="72" name="/block.0/layer.0/SelfAttention/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/block.0/layer.0/SelfAttention/Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_17" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_17_output_0" />
			</output>
		</layer>
		<layer id="74" name="/block.0/layer.0/SelfAttention/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Add" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/block.0/layer.0/SelfAttention/Abs" type="Abs" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Abs" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/block.0/layer.0/SelfAttention/Abs_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/block.0/layer.0/SelfAttention/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="149748" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_18" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_18_output_0" />
			</output>
		</layer>
		<layer id="77" name="/block.0/layer.0/SelfAttention/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Less" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="/block.0/layer.0/SelfAttention/Less_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/block.0/layer.0/SelfAttention/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Cast_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/block.0/layer.0/SelfAttention/Cast_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/block.0/layer.0/SelfAttention/Constant_19" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="141340" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_19" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/block.0/layer.0/SelfAttention/Constant_19_output_0" />
			</output>
		</layer>
		<layer id="80" name="/block.0/layer.0/SelfAttention/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/block.0/layer.0/SelfAttention/Log" type="Log" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Log" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/block.0/layer.0/SelfAttention/Log_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/block.0/layer.0/SelfAttention/Constant_20" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="149756" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_20" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/block.0/layer.0/SelfAttention/Constant_20_output_0" />
			</output>
		</layer>
		<layer id="83" name="/block.0/layer.0/SelfAttention/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Div_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/Div_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/block.0/layer.0/SelfAttention/Constant_21" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="141340" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_21" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/block.0/layer.0/SelfAttention/Constant_21_output_0" />
			</output>
		</layer>
		<layer id="85" name="/block.0/layer.0/SelfAttention/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Mul_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/Mul_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/block.0/layer.0/SelfAttention/Cast_3" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Cast_3" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/block.0/layer.0/SelfAttention/Cast_3_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/block.0/layer.0/SelfAttention/Constant_22" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="149748" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_22" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_22_output_0" />
			</output>
		</layer>
		<layer id="88" name="/block.0/layer.0/SelfAttention/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_4657976" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="149760" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657976" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="90" name="/block.0/layer.0/SelfAttention/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Shape_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/block.0/layer.0/SelfAttention/Shape_2_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/block.0/layer.0/SelfAttention/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/ConstantOfShape" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/ConstantOfShape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/block.0/layer.0/SelfAttention/Min" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Min" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Min_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/block.0/layer.0/SelfAttention/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Where" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/block.0/layer.0/SelfAttention/Where_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/block.0/layer.0/SelfAttention/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Add_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/block.0/layer.0/SelfAttention/Add_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_4657987" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657987" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="96" name="/block.0/layer.0/SelfAttention/relative_attention_bias/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/relative_attention_bias/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/block.0/layer.0/SelfAttention/relative_attention_bias/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_4657989" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="149768" size="24" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4657989" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/block.0/layer.0/SelfAttention/Transpose_3" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Transpose_3" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/block.0/layer.0/SelfAttention/Transpose_3_output_0">
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/block.0/layer.0/SelfAttention/Constant_23" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="141328" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/block.0/layer.0/SelfAttention/Constant_23" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/block.0/layer.0/SelfAttention/Constant_23_output_0">
					<dim>1</dim>
				</port>
			</output>
