<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="2" name="encoder_attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="encoder_attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="encoder_attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="encoder_hidden_states" type="Parameter" version="opset1">
			<data shape="?,?,32" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="encoder_hidden_states" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="onnx::MatMul_1212" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="0" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_1212" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_1212">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/decoder/block.4/layer.1/EncDecAttention/v/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.4/layer.1/EncDecAttention/v/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.4/layer.1/EncDecAttention/v/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="decoder.block.0.layer.1.layer_norm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="4096" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="decoder.block.0.layer.1.layer_norm.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="decoder.block.0.layer.0.layer_norm.weight,decoder.block.0.layer.1.layer_norm.weight,decoder.block.0.layer.2.layer_norm.weight,decoder.block.1.layer.0.layer_norm.weight,decoder.block.1.layer.1.layer_norm.weight,decoder.block.1.layer.2.layer_norm.weight,decoder.block.2.layer.0.layer_norm.weight,decoder.block.2.layer.1.layer_norm.weight,decoder.block.2.layer.2.layer_norm.weight,decoder.block.3.layer.0.layer_norm.weight,decoder.block.3.layer.1.layer_norm.weight,decoder.block.3.layer.2.layer_norm.weight,decoder.block.4.layer.0.layer_norm.weight,decoder.block.4.layer.1.layer_norm.weight,decoder.block.4.layer.2.layer_norm.weight,decoder.final_layer_norm.weight">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="shared.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1103, 32" offset="4224" size="141184" />
			<rt_info>
				<attribute name="fused_names" version="0" value="shared.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="shared.weight">
					<dim>1103</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/decoder/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145408" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/decoder/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/Shape_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/decoder/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145416" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="10" name="Constant_4658513" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658513" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="/decoder/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Constant_1, /decoder/Gather_1, Constant_4658513" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="12" name="Constant_22" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_22" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_123">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/decoder/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Unsqueeze, Constant_22" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/decoder/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Concat, /decoder/Constant_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/decoder/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_4658526" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658526" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="/decoder/shared/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/shared/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1103</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/decoder/shared/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/decoder/block.0/layer.0/layer_norm/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/decoder/block.0/layer.0/layer_norm/Constant_2" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="145432" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="20" name="/decoder/block.0/layer.0/layer_norm/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="145436" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Constant_output_0" />
			</output>
		</layer>
		<layer id="21" name="/decoder/block.0/layer.0/layer_norm/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_4658637" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145408" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658637" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/decoder/block.0/layer.0/layer_norm/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/decoder/block.0/layer.0/layer_norm/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="145440" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="25" name="/decoder/block.0/layer.0/layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/decoder/block.0/layer.0/layer_norm/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/decoder/block.0/layer.0/layer_norm/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/decoder/block.0/layer.0/layer_norm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/decoder/block.0/layer.0/layer_norm/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/layer_norm/Mul_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/layer_norm/Mul_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="onnx::MatMul_1056" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="145444" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_1056" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_1056">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/decoder/block.0/layer.0/SelfAttention/q/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/q/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/q/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/decoder/block.0/layer.0/SelfAttention/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/decoder/block.0/layer.0/SelfAttention/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_output_0" />
			</output>
		</layer>
		<layer id="34" name="Constant_4658648" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658648" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="/decoder/block.0/layer.0/SelfAttention/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant, /decoder/block.0/layer.0/SelfAttention/Gather, Constant_4658648" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Gather_output_0" />
			</output>
		</layer>
		<layer id="36" name="Constant_100" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_100" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_206">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/decoder/block.0/layer.0/SelfAttention/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Unsqueeze, Constant_100" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/decoder/block.0/layer.0/SelfAttention/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145408" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/decoder/block.0/layer.0/SelfAttention/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="149540" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/decoder/block.0/layer.0/SelfAttention/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="149548" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/decoder/block.0/layer.0/SelfAttention/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Concat, /decoder/block.0/layer.0/SelfAttention/Constant_2, /decoder/block.0/layer.0/SelfAttention/Constant_3, /decoder/block.0/layer.0/SelfAttention/Constant_4" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/decoder/block.0/layer.0/SelfAttention/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_4658680" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="149556" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658680" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/decoder/block.0/layer.0/SelfAttention/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Transpose" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Transpose_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="onnx::MatMul_1066" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="149588" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_1066" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_1066">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/decoder/block.0/layer.0/SelfAttention/k/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/k/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/k/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_106" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_106" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_215">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_1, Constant_106" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/decoder/block.0/layer.0/SelfAttention/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145408" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/decoder/block.0/layer.0/SelfAttention/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="149540" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/decoder/block.0/layer.0/SelfAttention/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="149548" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_7" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/decoder/block.0/layer.0/SelfAttention/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Concat_1, /decoder/block.0/layer.0/SelfAttention/Constant_5, /decoder/block.0/layer.0/SelfAttention/Constant_6, /decoder/block.0/layer.0/SelfAttention/Constant_7" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/decoder/block.0/layer.0/SelfAttention/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Reshape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_4658702" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="153684" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658702" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/decoder/block.0/layer.0/SelfAttention/Transpose_3" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Transpose_3" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Transpose_3_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/decoder/block.0/layer.0/SelfAttention/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/MatMul_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 4" offset="153716" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight">
					<dim>8</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/decoder/block.0/layer.0/SelfAttention/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_11" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_11_output_0" />
			</output>
		</layer>
		<layer id="59" name="/decoder/block.0/layer.0/SelfAttention/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/decoder/block.0/layer.0/SelfAttention/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145416" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="61" name="Constant_4658652" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658652" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="62" name="/decoder/block.0/layer.0/SelfAttention/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_1, /decoder/block.0/layer.0/SelfAttention/Gather_1, Constant_4658652" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="63" name="/decoder/block.0/layer.0/SelfAttention/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Cast_output_0" />
			</output>
		</layer>
		<layer id="64" name="/decoder/block.0/layer.0/SelfAttention/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145416" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_12" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_12_output_0" />
			</output>
		</layer>
		<layer id="65" name="/decoder/block.0/layer.0/SelfAttention/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Range" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/decoder/block.0/layer.0/SelfAttention/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_14" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_4" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_4_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/decoder/block.0/layer.0/SelfAttention/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="145416" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_13" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_3" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Unsqueeze_3_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/decoder/block.0/layer.0/SelfAttention/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_4658728" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658728" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="72" name="/decoder/block.0/layer.0/SelfAttention/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Shape_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Shape_2_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/decoder/block.0/layer.0/SelfAttention/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/ConstantOfShape" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/ConstantOfShape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/decoder/block.0/layer.0/SelfAttention/Min" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Min" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Min_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/decoder/block.0/layer.0/SelfAttention/Neg" type="Negative" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Neg" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Neg_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/decoder/block.0/layer.0/SelfAttention/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="149540" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_15" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_15_output_0" />
			</output>
		</layer>
		<layer id="77" name="/decoder/block.0/layer.0/SelfAttention/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Less" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="/decoder/block.0/layer.0/SelfAttention/Less_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/decoder/block.0/layer.0/SelfAttention/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Cast_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Cast_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/decoder/block.0/layer.0/SelfAttention/Constant_16" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="153844" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Constant_16_output_0" />
			</output>
		</layer>
		<layer id="80" name="/decoder/block.0/layer.0/SelfAttention/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/decoder/block.0/layer.0/SelfAttention/Log" type="Log" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Log" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Log_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/decoder/block.0/layer.0/SelfAttention/Constant_17" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="153848" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_17" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Constant_17_output_0" />
			</output>
		</layer>
		<layer id="83" name="/decoder/block.0/layer.0/SelfAttention/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Div_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Div_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/decoder/block.0/layer.0/SelfAttention/Constant_18" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="153844" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_18" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Constant_18_output_0" />
			</output>
		</layer>
		<layer id="85" name="/decoder/block.0/layer.0/SelfAttention/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoder/block.0/layer.0/SelfAttention/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/decoder/block.0/layer.0/SelfAttention/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Cast_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Cast_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/decoder/block.0/layer.0/SelfAttention/Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="149540" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Constant_19" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Constant_19_output_0" />
			</output>
		</layer>
		<layer id="88" name="/decoder/block.0/layer.0/SelfAttention/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Add" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_4658753" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="153852" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658753" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="90" name="/decoder/block.0/layer.0/SelfAttention/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Shape_3" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Shape_3_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/decoder/block.0/layer.0/SelfAttention/ConstantOfShape_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/ConstantOfShape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/ConstantOfShape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/decoder/block.0/layer.0/SelfAttention/Min_1" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Min_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Min_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/decoder/block.0/layer.0/SelfAttention/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/Where" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/decoder/block.0/layer.0/SelfAttention/Where_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_4658763" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="145424" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4658763" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="95" name="/decoder/block.0/layer.0/SelfAttention/relative_attention_bias/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/decoder/block.0/layer.0/SelfAttention/relative_attention_bias/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
