<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="2" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="token_type_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="token_type_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="token_type_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="cls.predictions.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1124" offset="0" size="4496" />
			<rt_info>
				<attribute name="fused_names" version="0" value="cls.predictions.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="cls.predictions.bias">
					<dim>1124</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="bert.encoder.layer.0.attention.self.query.bias" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="4496" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="bert.encoder.layer.0.attention.self.query.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="bert.embeddings.LayerNorm.bias,bert.encoder.layer.0.attention.output.LayerNorm.bias,bert.encoder.layer.0.attention.output.dense.bias,bert.encoder.layer.0.attention.self.key.bias,bert.encoder.layer.0.attention.self.query.bias,bert.encoder.layer.0.attention.self.value.bias,bert.encoder.layer.0.output.LayerNorm.bias,bert.encoder.layer.0.output.dense.bias,bert.encoder.layer.1.attention.output.LayerNorm.bias,bert.encoder.layer.1.attention.output.dense.bias,bert.encoder.layer.1.attention.self.key.bias,bert.encoder.layer.1.attention.self.query.bias,bert.encoder.layer.1.attention.self.value.bias,bert.encoder.layer.1.output.LayerNorm.bias,bert.encoder.layer.1.output.dense.bias,bert.encoder.layer.2.attention.output.LayerNorm.bias,bert.encoder.layer.2.attention.output.dense.bias,bert.encoder.layer.2.attention.self.key.bias,bert.encoder.layer.2.attention.self.query.bias,bert.encoder.layer.2.attention.self.value.bias,bert.encoder.layer.2.output.LayerNorm.bias,bert.encoder.layer.2.output.dense.bias,bert.encoder.layer.3.attention.output.LayerNorm.bias,bert.encoder.layer.3.attention.output.dense.bias,bert.encoder.layer.3.attention.self.key.bias,bert.encoder.layer.3.attention.self.query.bias,bert.encoder.layer.3.attention.self.value.bias,bert.encoder.layer.3.output.LayerNorm.bias,bert.encoder.layer.3.output.dense.bias,bert.encoder.layer.4.attention.output.LayerNorm.bias,bert.encoder.layer.4.attention.output.dense.bias,bert.encoder.layer.4.attention.self.key.bias,bert.encoder.layer.4.attention.self.query.bias,bert.encoder.layer.4.attention.self.value.bias,bert.encoder.layer.4.output.LayerNorm.bias,bert.encoder.layer.4.output.dense.bias,cls.predictions.transform.LayerNorm.bias,cls.predictions.transform.dense.bias">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="bert.encoder.layer.1.intermediate.dense.bias" type="Const" version="opset1">
			<data element_type="f32" shape="37" offset="4624" size="148" />
			<rt_info>
				<attribute name="fused_names" version="0" value="bert.encoder.layer.1.intermediate.dense.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="bert.encoder.layer.0.intermediate.dense.bias,bert.encoder.layer.1.intermediate.dense.bias,bert.encoder.layer.2.intermediate.dense.bias,bert.encoder.layer.3.intermediate.dense.bias,bert.encoder.layer.4.intermediate.dense.bias">
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="bert.embeddings.word_embeddings.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1124, 32" offset="4772" size="143872" />
			<rt_info>
				<attribute name="fused_names" version="0" value="bert.embeddings.word_embeddings.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="bert.embeddings.word_embeddings.weight">
					<dim>1124</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_4451893" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451893" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="/bert/embeddings/word_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/word_embeddings/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1124</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/bert/embeddings/word_embeddings/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="bert.embeddings.token_type_embeddings.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32" offset="148652" size="2048" />
			<rt_info>
				<attribute name="fused_names" version="0" value="bert.embeddings.token_type_embeddings.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="bert.embeddings.token_type_embeddings.weight">
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_4451895" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451895" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="/bert/embeddings/token_type_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/token_type_embeddings/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/bert/embeddings/token_type_embeddings/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/bert/embeddings/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bert.embeddings.position_embeddings.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 32" offset="150700" size="65536" />
			<rt_info>
				<attribute name="fused_names" version="0" value="bert.embeddings.position_embeddings.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="bert.embeddings.position_embeddings.weight">
					<dim>512</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_62" type="Const" version="opset1">
			<data element_type="i64" shape="1, 512" offset="216236" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_62" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Slice_105">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/bert/embeddings/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/embeddings/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/bert/embeddings/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/bert/embeddings/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/bert/embeddings/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="220332" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/embeddings/Constant_output_0" />
			</output>
		</layer>
		<layer id="18" name="Constant_4451878" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451878" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="19" name="/bert/embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Constant, /bert/embeddings/Gather, Constant_4451878" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/bert/embeddings/Gather_output_0" />
			</output>
		</layer>
		<layer id="20" name="Constant_4451882" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451882" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/bert/embeddings/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Unsqueeze, Constant_4451882" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/bert/embeddings/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/bert/embeddings/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="220332" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/embeddings/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/bert/embeddings/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="220332" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/embeddings/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/bert/embeddings/Slice" type="Slice" version="opset8">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Slice" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/bert/embeddings/Slice_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_4451898" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451898" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="26" name="/bert/embeddings/position_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/position_embeddings/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/bert/embeddings/position_embeddings/Gather_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/bert/embeddings/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_4451901" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="220340" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451901" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/bert/embeddings/LayerNorm/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/LayerNorm/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/bert/embeddings/LayerNorm/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/LayerNorm/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/bert/embeddings/LayerNorm/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="220348" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/bert/embeddings/LayerNorm/Constant_output_0" />
			</output>
		</layer>
		<layer id="32" name="/bert/embeddings/LayerNorm/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/LayerNorm/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_4451906" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="220340" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451906" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/bert/embeddings/LayerNorm/ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/ReduceMean_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/LayerNorm/ReduceMean_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/bert/embeddings/LayerNorm/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="220352" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/bert/embeddings/LayerNorm/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="36" name="/bert/embeddings/LayerNorm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/LayerNorm/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/bert/embeddings/LayerNorm/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/bert/embeddings/LayerNorm/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/bert/embeddings/LayerNorm/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/LayerNorm/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="bert.encoder.layer.0.attention.output.LayerNorm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="220356" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="bert.encoder.layer.0.attention.output.LayerNorm.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="bert.embeddings.LayerNorm.weight,bert.encoder.layer.0.attention.output.LayerNorm.weight,bert.encoder.layer.0.output.LayerNorm.weight,bert.encoder.layer.1.attention.output.LayerNorm.weight,bert.encoder.layer.1.output.LayerNorm.weight,bert.encoder.layer.2.attention.output.LayerNorm.weight,bert.encoder.layer.2.output.LayerNorm.weight,bert.encoder.layer.3.attention.output.LayerNorm.weight,bert.encoder.layer.3.output.LayerNorm.weight,bert.encoder.layer.4.attention.output.LayerNorm.weight,bert.encoder.layer.4.output.LayerNorm.weight,cls.predictions.transform.LayerNorm.weight">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/bert/embeddings/LayerNorm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/LayerNorm/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/bert/embeddings/LayerNorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/embeddings/LayerNorm/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/embeddings/LayerNorm/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="onnx::MatMul_692" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="220484" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_692" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_692">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/bert/encoder/layer.0/attention/self/query/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/query/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/query/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/bert/encoder/layer.0/attention/self/query/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/query/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/query/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/bert/encoder/layer.0/attention/self/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Shape_4" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/bert/encoder/layer.0/attention/self/Shape_4_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/bert/encoder/layer.0/attention/self/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_8" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/encoder/layer.0/attention/self/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="47" name="Constant_4451976" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451976" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="48" name="/bert/encoder/layer.0/attention/self/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_8, /bert/encoder/layer.0/attention/self/Gather_4, Constant_4451976" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/bert/encoder/layer.0/attention/self/Gather_4_output_0" />
			</output>
		</layer>
		<layer id="49" name="Constant_4451982" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451982" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/bert/encoder/layer.0/attention/self/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Unsqueeze_4, Constant_4451982" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/bert/encoder/layer.0/attention/self/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/bert/encoder/layer.0/attention/self/Shape_5" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Shape_5" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/bert/encoder/layer.0/attention/self/Shape_5_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/bert/encoder/layer.0/attention/self/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="220332" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_9" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/encoder/layer.0/attention/self/Constant_9_output_0" />
			</output>
		</layer>
		<layer id="53" name="Constant_4451980" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451980" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="54" name="/bert/encoder/layer.0/attention/self/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_9, /bert/encoder/layer.0/attention/self/Gather_5, Constant_4451980" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/bert/encoder/layer.0/attention/self/Gather_5_output_0" />
			</output>
		</layer>
		<layer id="55" name="Constant_4451984" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451984" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/bert/encoder/layer.0/attention/self/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Unsqueeze_5, Constant_4451984" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/bert/encoder/layer.0/attention/self/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/bert/encoder/layer.0/attention/self/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="224580" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_10" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/encoder/layer.0/attention/self/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/bert/encoder/layer.0/attention/self/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="224588" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_11" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/encoder/layer.0/attention/self/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/bert/encoder/layer.0/attention/self/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Concat_2, /bert/encoder/layer.0/attention/self/Constant_10, /bert/encoder/layer.0/attention/self/Constant_11" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/bert/encoder/layer.0/attention/self/Concat_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/bert/encoder/layer.0/attention/self/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Reshape_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/Reshape_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_4452000" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="224596" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4452000" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/bert/encoder/layer.0/attention/self/Transpose_1" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Transpose_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/Transpose_1_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="onnx::MatMul_693" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="224628" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_693" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_693">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/bert/encoder/layer.0/attention/self/key/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/key/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/key/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/bert/encoder/layer.0/attention/self/key/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/key/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/key/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/bert/encoder/layer.0/attention/self/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/bert/encoder/layer.0/attention/self/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/bert/encoder/layer.0/attention/self/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/encoder/layer.0/attention/self/Constant_output_0" />
			</output>
		</layer>
		<layer id="68" name="Constant_4451920" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451920" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="69" name="/bert/encoder/layer.0/attention/self/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant, /bert/encoder/layer.0/attention/self/Gather, Constant_4451920" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/bert/encoder/layer.0/attention/self/Gather_output_0" />
			</output>
		</layer>
		<layer id="70" name="Constant_4451926" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451926" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/bert/encoder/layer.0/attention/self/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Unsqueeze, Constant_4451926" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/bert/encoder/layer.0/attention/self/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/bert/encoder/layer.0/attention/self/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/bert/encoder/layer.0/attention/self/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/bert/encoder/layer.0/attention/self/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="220332" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/encoder/layer.0/attention/self/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="74" name="Constant_4451924" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451924" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="75" name="/bert/encoder/layer.0/attention/self/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_1, /bert/encoder/layer.0/attention/self/Gather_1, Constant_4451924" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/bert/encoder/layer.0/attention/self/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="76" name="Constant_4451928" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="148644" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451928" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/bert/encoder/layer.0/attention/self/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Unsqueeze_1, Constant_4451928" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/bert/encoder/layer.0/attention/self/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/bert/encoder/layer.0/attention/self/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="224580" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/encoder/layer.0/attention/self/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/bert/encoder/layer.0/attention/self/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="224588" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/bert/encoder/layer.0/attention/self/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/bert/encoder/layer.0/attention/self/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Concat, /bert/encoder/layer.0/attention/self/Constant_2, /bert/encoder/layer.0/attention/self/Constant_3" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/bert/encoder/layer.0/attention/self/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/bert/encoder/layer.0/attention/self/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_4452002" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="228724" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4452002" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/bert/encoder/layer.0/attention/self/Transpose_2" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Transpose_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/bert/encoder/layer.0/attention/self/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/MatMul_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/bert/encoder/layer.0/attention/self/Constant_12" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="228756" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Constant_12" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/bert/encoder/layer.0/attention/self/Constant_12_output_0" />
			</output>
		</layer>
		<layer id="86" name="/bert/encoder/layer.0/attention/self/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/encoder/layer.0/attention/self/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/encoder/layer.0/attention/self/Div_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/bert/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="228760" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/bert/Constant_output_0" />
			</output>
		</layer>
		<layer id="88" name="Constant_4451867" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="220332" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451867" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/bert/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/Unsqueeze" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/bert/Unsqueeze_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_4451869" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="228764" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4451869" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/bert/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/Unsqueeze_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/bert/Unsqueeze_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/bert/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/bert/Cast_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/bert/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/bert/Sub_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/bert/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="228772" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/bert/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="95" name="/bert/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/bert/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
