<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="qa_outputs.bias" type="Const" version="opset1">
			<data element_type="f32" shape="2" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="qa_outputs.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="qa_outputs.bias">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="roberta.encoder.layer.0.attention.self.query.bias" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="8" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="roberta.encoder.layer.0.attention.self.query.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="roberta.embeddings.LayerNorm.bias,roberta.encoder.layer.0.attention.output.LayerNorm.bias,roberta.encoder.layer.0.attention.output.dense.bias,roberta.encoder.layer.0.attention.self.key.bias,roberta.encoder.layer.0.attention.self.query.bias,roberta.encoder.layer.0.attention.self.value.bias,roberta.encoder.layer.0.output.LayerNorm.bias,roberta.encoder.layer.0.output.dense.bias,roberta.encoder.layer.1.attention.output.LayerNorm.bias,roberta.encoder.layer.1.attention.output.dense.bias,roberta.encoder.layer.1.attention.self.key.bias,roberta.encoder.layer.1.attention.self.query.bias,roberta.encoder.layer.1.attention.self.value.bias,roberta.encoder.layer.1.output.LayerNorm.bias,roberta.encoder.layer.1.output.dense.bias,roberta.encoder.layer.2.attention.output.LayerNorm.bias,roberta.encoder.layer.2.attention.output.dense.bias,roberta.encoder.layer.2.attention.self.key.bias,roberta.encoder.layer.2.attention.self.query.bias,roberta.encoder.layer.2.attention.self.value.bias,roberta.encoder.layer.2.output.LayerNorm.bias,roberta.encoder.layer.2.output.dense.bias,roberta.encoder.layer.3.attention.output.LayerNorm.bias,roberta.encoder.layer.3.attention.output.dense.bias,roberta.encoder.layer.3.attention.self.key.bias,roberta.encoder.layer.3.attention.self.query.bias,roberta.encoder.layer.3.attention.self.value.bias,roberta.encoder.layer.3.output.LayerNorm.bias,roberta.encoder.layer.3.output.dense.bias,roberta.encoder.layer.4.attention.output.LayerNorm.bias,roberta.encoder.layer.4.attention.output.dense.bias,roberta.encoder.layer.4.attention.self.key.bias,roberta.encoder.layer.4.attention.self.query.bias,roberta.encoder.layer.4.attention.self.value.bias,roberta.encoder.layer.4.output.LayerNorm.bias,roberta.encoder.layer.4.output.dense.bias">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="roberta.encoder.layer.1.intermediate.dense.bias" type="Const" version="opset1">
			<data element_type="f32" shape="37" offset="136" size="148" />
			<rt_info>
				<attribute name="fused_names" version="0" value="roberta.encoder.layer.1.intermediate.dense.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="roberta.encoder.layer.0.intermediate.dense.bias,roberta.encoder.layer.1.intermediate.dense.bias,roberta.encoder.layer.2.intermediate.dense.bias,roberta.encoder.layer.3.intermediate.dense.bias,roberta.encoder.layer.4.intermediate.dense.bias">
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="roberta.embeddings.word_embeddings.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1000, 32" offset="284" size="128000" />
			<rt_info>
				<attribute name="fused_names" version="0" value="roberta.embeddings.word_embeddings.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="roberta.embeddings.word_embeddings.weight">
					<dim>1000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_4595607" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595607" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="7" name="/roberta/embeddings/word_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/word_embeddings/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1000</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/roberta/embeddings/word_embeddings/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="roberta.embeddings.token_type_embeddings.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32" offset="128284" size="2048" />
			<rt_info>
				<attribute name="fused_names" version="0" value="roberta.embeddings.token_type_embeddings.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="roberta.embeddings.token_type_embeddings.weight">
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_55" type="Const" version="opset1">
			<data element_type="i64" shape="1, 512" offset="130332" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_55" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Slice_97">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/roberta/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/roberta/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/roberta/Shape_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/roberta/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="134428" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="13" name="Constant_4595507" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595507" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="/roberta/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant_1, /roberta/Gather_1, Constant_4595507" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/roberta/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="15" name="Constant_4595511" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595511" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/roberta/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Unsqueeze, Constant_4595511" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/roberta/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="134428" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/roberta/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="134428" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/roberta/Slice" type="Slice" version="opset8">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Slice" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/roberta/Slice_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/roberta/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/roberta/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/roberta/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/Constant_output_0" />
			</output>
		</layer>
		<layer id="22" name="Constant_4595503" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595503" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="23" name="/roberta/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant, /roberta/Gather, Constant_4595503" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/roberta/Gather_output_0" />
			</output>
		</layer>
		<layer id="24" name="Constant_4595522" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595522" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/roberta/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Unsqueeze_1, Constant_4595522" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_4595524" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595524" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/roberta/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Unsqueeze_2, Constant_4595524" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/roberta/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Concat" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_4596784" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="134436" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Reshape" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/roberta/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/Reshape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_4595533" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="134428" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595533" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="32" name="/roberta/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Shape_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/roberta/Shape_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/roberta/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/ConstantOfShape, Constant_4595533" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/ConstantOfShape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/roberta/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="134436" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/Constant_6_output_0" />
			</output>
		</layer>
		<layer id="35" name="/roberta/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Constant_6, /roberta/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/Mul_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/roberta/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Equal" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/roberta/Equal_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/roberta/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Where" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/roberta/Where_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/roberta/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/Expand" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/Expand_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_4595609" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595609" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="40" name="/roberta/embeddings/token_type_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/token_type_embeddings/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/roberta/embeddings/token_type_embeddings/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/roberta/embeddings/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="roberta.embeddings.position_embeddings.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 32" offset="134444" size="65536" />
			<rt_info>
				<attribute name="fused_names" version="0" value="roberta.embeddings.position_embeddings.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="roberta.embeddings.position_embeddings.weight">
					<dim>512</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/roberta/embeddings/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="134428" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/embeddings/Constant_output_0" />
			</output>
		</layer>
		<layer id="44" name="/roberta/embeddings/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Equal" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="/roberta/embeddings/Equal_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/roberta/embeddings/Not" type="LogicalNot" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Not" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="/roberta/embeddings/Not_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/roberta/embeddings/Cast" type="Convert" version="opset1">
			<data destination_type="i32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="/roberta/embeddings/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/roberta/embeddings/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="199980" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="/roberta/embeddings/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="48" name="/roberta/embeddings/CumSum" type="CumSum" version="opset3">
			<data exclusive="false" reverse="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/CumSum" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="/roberta/embeddings/CumSum_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/roberta/embeddings/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="/roberta/embeddings/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/roberta/embeddings/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Cast_1" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/roberta/embeddings/Cast_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/roberta/embeddings/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="134428" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/embeddings/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="52" name="/roberta/embeddings/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Add" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/embeddings/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_4595612" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595612" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="54" name="/roberta/embeddings/position_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/position_embeddings/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/roberta/embeddings/position_embeddings/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/roberta/embeddings/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/Add_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/Add_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_4595615" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="134436" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595615" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/roberta/embeddings/LayerNorm/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/LayerNorm/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/roberta/embeddings/LayerNorm/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/LayerNorm/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/roberta/embeddings/LayerNorm/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="199984" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/roberta/embeddings/LayerNorm/Constant_output_0" />
			</output>
		</layer>
		<layer id="60" name="/roberta/embeddings/LayerNorm/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/LayerNorm/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_4595620" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="134436" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595620" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/roberta/embeddings/LayerNorm/ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/ReduceMean_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/LayerNorm/ReduceMean_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/roberta/embeddings/LayerNorm/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="199988" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/roberta/embeddings/LayerNorm/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="64" name="/roberta/embeddings/LayerNorm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/LayerNorm/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/roberta/embeddings/LayerNorm/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/roberta/embeddings/LayerNorm/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/roberta/embeddings/LayerNorm/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/LayerNorm/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="roberta.encoder.layer.0.attention.output.LayerNorm.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="199992" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="roberta.encoder.layer.0.attention.output.LayerNorm.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="roberta.embeddings.LayerNorm.weight,roberta.encoder.layer.0.attention.output.LayerNorm.weight,roberta.encoder.layer.0.output.LayerNorm.weight,roberta.encoder.layer.1.attention.output.LayerNorm.weight,roberta.encoder.layer.1.output.LayerNorm.weight,roberta.encoder.layer.2.attention.output.LayerNorm.weight,roberta.encoder.layer.2.output.LayerNorm.weight,roberta.encoder.layer.3.attention.output.LayerNorm.weight,roberta.encoder.layer.3.output.LayerNorm.weight,roberta.encoder.layer.4.attention.output.LayerNorm.weight,roberta.encoder.layer.4.output.LayerNorm.weight">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/roberta/embeddings/LayerNorm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/LayerNorm/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/roberta/embeddings/LayerNorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/embeddings/LayerNorm/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/embeddings/LayerNorm/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="onnx::MatMul_695" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="200120" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_695" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_695">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/roberta/encoder/layer.0/attention/self/query/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/query/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/encoder/layer.0/attention/self/query/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/roberta/encoder/layer.0/attention/self/query/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/query/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/encoder/layer.0/attention/self/query/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/roberta/encoder/layer.0/attention/self/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Shape_4" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/roberta/encoder/layer.0/attention/self/Shape_4_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/roberta/encoder/layer.0/attention/self/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Constant_8" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/encoder/layer.0/attention/self/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="75" name="Constant_4595690" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595690" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="76" name="/roberta/encoder/layer.0/attention/self/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Constant_8, /roberta/encoder/layer.0/attention/self/Gather_4, Constant_4595690" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/roberta/encoder/layer.0/attention/self/Gather_4_output_0" />
			</output>
		</layer>
		<layer id="77" name="Constant_4595696" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595696" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/roberta/encoder/layer.0/attention/self/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Unsqueeze_4, Constant_4595696" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/encoder/layer.0/attention/self/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/roberta/encoder/layer.0/attention/self/Shape_5" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Shape_5" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/roberta/encoder/layer.0/attention/self/Shape_5_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/roberta/encoder/layer.0/attention/self/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="134428" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Constant_9" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/encoder/layer.0/attention/self/Constant_9_output_0" />
			</output>
		</layer>
		<layer id="81" name="Constant_4595694" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595694" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="82" name="/roberta/encoder/layer.0/attention/self/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Constant_9, /roberta/encoder/layer.0/attention/self/Gather_5, Constant_4595694" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/roberta/encoder/layer.0/attention/self/Gather_5_output_0" />
			</output>
		</layer>
		<layer id="83" name="Constant_4595698" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595698" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/roberta/encoder/layer.0/attention/self/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Unsqueeze_5, Constant_4595698" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/roberta/encoder/layer.0/attention/self/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/roberta/encoder/layer.0/attention/self/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="204216" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Constant_10" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/encoder/layer.0/attention/self/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/roberta/encoder/layer.0/attention/self/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="204224" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Constant_11" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/encoder/layer.0/attention/self/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/roberta/encoder/layer.0/attention/self/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Concat_2, /roberta/encoder/layer.0/attention/self/Constant_10, /roberta/encoder/layer.0/attention/self/Constant_11" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/roberta/encoder/layer.0/attention/self/Concat_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/roberta/encoder/layer.0/attention/self/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Reshape_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/encoder/layer.0/attention/self/Reshape_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_4595714" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="204232" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595714" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/roberta/encoder/layer.0/attention/self/Transpose_1" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Transpose_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/encoder/layer.0/attention/self/Transpose_1_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx::MatMul_696" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32" offset="204264" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::MatMul_696" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_696">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/roberta/encoder/layer.0/attention/self/key/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/key/MatMul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/encoder/layer.0/attention/self/key/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/roberta/encoder/layer.0/attention/self/key/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/key/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/roberta/encoder/layer.0/attention/self/key/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/roberta/encoder/layer.0/attention/self/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/roberta/encoder/layer.0/attention/self/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/roberta/encoder/layer.0/attention/self/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/roberta/encoder/layer.0/attention/self/Constant_output_0" />
			</output>
		</layer>
		<layer id="96" name="Constant_4595634" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4595634" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="97" name="/roberta/encoder/layer.0/attention/self/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/roberta/encoder/layer.0/attention/self/Constant, /roberta/encoder/layer.0/attention/self/Gather, Constant_4595634" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/roberta/encoder/layer.0/attention/self/Gather_output_0" />
			</output>
		</layer>
		<layer id="98" name="Constant_4595640" type="Const" version="opset1">
