<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="11" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="past_key_values.0.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.0.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="past_key_values.0.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.0.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="past_key_values.1.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.1.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="past_key_values.1.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.1.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="past_key_values.2.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.2.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="past_key_values.2.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.2.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="past_key_values.3.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.3.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="past_key_values.3.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.3.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="past_key_values.4.key" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.4.key" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="past_key_values.4.value" type="Parameter" version="opset1">
			<data shape="?,4,?,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="past_key_values.4.value" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_212" type="Const" version="opset1">
			<data element_type="boolean" shape="1, 1, 512, 512" offset="0" size="262144" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_212" />
			</rt_info>
			<output>
				<port id="0" precision="BOOL" names="onnx::Slice_271">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="transformer.wte.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1000, 32" offset="262144" size="128000" />
			<rt_info>
				<attribute name="fused_names" version="0" value="transformer.wte.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="transformer.wte.weight">
					<dim>1000</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/transformer/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390144" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/transformer/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/Shape_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/transformer/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390152" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="17" name="Constant_4611237" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611237" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="/transformer/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_1, /transformer/Gather_1, Constant_4611237" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transformer/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="19" name="Constant_45" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_45" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_86">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/transformer/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Unsqueeze, Constant_45" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/transformer/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Concat, /transformer/Constant_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/transformer/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_4611389" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611389" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="24" name="/transformer/wte/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/wte/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1000</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/wte/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="transformer.wpe.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 32" offset="390168" size="65536" />
			<rt_info>
				<attribute name="fused_names" version="0" value="transformer.wpe.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="transformer.wpe.weight">
					<dim>512</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/transformer/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Shape_3" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/Shape_3_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/transformer/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="455704" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/transformer/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390144" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_7" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_4611262" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390152" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611262" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="ShapeOf_4611263" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390152" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_6, ShapeOf_4611263" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Broadcast_4611264" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_6, Broadcast_4611264, Constant_4611262, ShapeOf_4611263" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/transformer/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/transformer/Slice" type="Slice" version="opset8">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_5, /transformer/Constant_6, /transformer/Constant_7, /transformer/Slice" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/transformer/Slice_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/transformer/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_8" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/transformer/Squeeze" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_8, /transformer/Squeeze" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Squeeze_output_0" />
			</output>
		</layer>
		<layer id="36" name="/transformer/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/Cast_output_0" />
			</output>
		</layer>
		<layer id="37" name="/transformer/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Add" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Add_output_0" />
			</output>
		</layer>
		<layer id="38" name="/transformer/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Cast_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/Cast_1_output_0" />
			</output>
		</layer>
		<layer id="39" name="/transformer/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390152" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_9" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_9_output_0" />
			</output>
		</layer>
		<layer id="40" name="/transformer/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Range" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transformer/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/transformer/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_10" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/transformer/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Unsqueeze_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Unsqueeze_2_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/transformer/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390144" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_49" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_49" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_91">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/transformer/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Unsqueeze_1, Constant_49" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/transformer/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Concat_1, /transformer/Constant_3" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Concat_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/transformer/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Reshape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_4611391" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611391" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="49" name="/transformer/wpe/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/wpe/Gather" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/wpe/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/transformer/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_4611407" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390144" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611407" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/transformer/h.0/ln_1/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/ReduceMean" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/ln_1/ReduceMean_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/transformer/h.0/ln_1/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Sub" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/ln_1/Sub_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/transformer/h.0/ln_1/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="455712" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/transformer/h.0/ln_1/Constant_output_0" />
			</output>
		</layer>
		<layer id="55" name="/transformer/h.0/ln_1/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Pow" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/ln_1/Pow_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_4611412" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390144" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611412" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/transformer/h.0/ln_1/ReduceMean_1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/ReduceMean_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/ln_1/ReduceMean_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/transformer/h.0/ln_1/Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="455716" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/transformer/h.0/ln_1/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="59" name="/transformer/h.0/ln_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/ln_1/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/transformer/h.0/ln_1/Sqrt" type="Sqrt" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transformer/h.0/ln_1/Sqrt_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/transformer/h.0/ln_1/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Div" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/ln_1/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="transformer.h.0.ln_2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="455720" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="transformer.h.0.ln_2.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="transformer.h.0.ln_1.weight,transformer.h.0.ln_2.weight,transformer.h.1.ln_1.weight,transformer.h.1.ln_2.weight,transformer.h.2.ln_1.weight,transformer.h.2.ln_2.weight,transformer.h.3.ln_1.weight,transformer.h.3.ln_2.weight,transformer.h.4.ln_1.weight,transformer.h.4.ln_2.weight,transformer.ln_f.weight">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/transformer/h.0/ln_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/ln_1/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="transformer.h.0.attn.c_proj.bias" type="Const" version="opset1">
			<data element_type="f32" shape="32" offset="455848" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="transformer.h.0.attn.c_proj.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="transformer.h.0.attn.c_proj.bias,transformer.h.0.ln_1.bias,transformer.h.0.ln_2.bias,transformer.h.0.mlp.c_proj.bias,transformer.h.1.attn.c_proj.bias,transformer.h.1.ln_1.bias,transformer.h.1.ln_2.bias,transformer.h.1.mlp.c_proj.bias,transformer.h.2.attn.c_proj.bias,transformer.h.2.ln_1.bias,transformer.h.2.ln_2.bias,transformer.h.2.mlp.c_proj.bias,transformer.h.3.attn.c_proj.bias,transformer.h.3.ln_1.bias,transformer.h.3.ln_2.bias,transformer.h.3.mlp.c_proj.bias,transformer.h.4.attn.c_proj.bias,transformer.h.4.ln_1.bias,transformer.h.4.ln_2.bias,transformer.h.4.mlp.c_proj.bias,transformer.ln_f.bias">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/transformer/h.0/ln_1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/ln_1/Add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/ln_1/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_4617363" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390144" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Concat, /transformer/h.0/attn/c_attn/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="ShapeOf_4617361" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="455976" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_4617360" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_4617359" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="70" name="Gather_4617362" type="Gather" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/transformer/h.0/attn/c_attn/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Concat, /transformer/h.0/attn/c_attn/Constant_6" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/h.0/attn/c_attn/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/transformer/h.0/attn/c_attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/attn/c_attn/Reshape_output_0">
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="transformer.h.0.attn.c_attn.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 96" offset="455992" size="12288" />
			<rt_info>
				<attribute name="fused_names" version="0" value="transformer.h.0.attn.c_attn.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="transformer.h.0.attn.c_attn.weight">
					<dim>32</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/transformer/h.0/attn/c_attn/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Gemm/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_4611452" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="468280" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611452" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="76" name="Multiply_4611455" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_4611455" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_4611453" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="468280" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611453" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="78" name="transformer.h.1.attn.c_attn.bias" type="Const" version="opset1">
			<data element_type="f32" shape="96" offset="468284" size="384" />
			<rt_info>
				<attribute name="fused_names" version="0" value="transformer.h.1.attn.c_attn.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="transformer.h.0.attn.c_attn.bias,transformer.h.1.attn.c_attn.bias,transformer.h.2.attn.c_attn.bias,transformer.h.3.attn.c_attn.bias,transformer.h.4.attn.c_attn.bias">
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Multiply_4611456" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_4611456" />
			</rt_info>
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/transformer/h.0/attn/c_attn/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Gemm" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/attn/c_attn/Gemm_output_0">
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/transformer/h.0/attn/c_attn/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/h.0/attn/c_attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/transformer/h.0/attn/c_attn/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/h.0/attn/c_attn/Constant_output_0" />
			</output>
		</layer>
		<layer id="83" name="Constant_4611422" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611422" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="84" name="/transformer/h.0/attn/c_attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Constant, /transformer/h.0/attn/c_attn/Gather, Constant_4611422" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transformer/h.0/attn/c_attn/Gather_output_0" />
			</output>
		</layer>
		<layer id="85" name="Constant_125" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_125" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_173">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/transformer/h.0/attn/c_attn/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Unsqueeze_1, Constant_125" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/h.0/attn/c_attn/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/transformer/h.0/attn/c_attn/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/h.0/attn/c_attn/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/transformer/h.0/attn/c_attn/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390152" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/h.0/attn/c_attn/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="89" name="Constant_4611426" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611426" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="90" name="/transformer/h.0/attn/c_attn/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Constant_1, /transformer/h.0/attn/c_attn/Gather_1, Constant_4611426" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transformer/h.0/attn/c_attn/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="91" name="Constant_127" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_127" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_175">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/transformer/h.0/attn/c_attn/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Unsqueeze_2, Constant_127" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/h.0/attn/c_attn/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/transformer/h.0/attn/c_attn/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="468668" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Constant_7" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/h.0/attn/c_attn/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/transformer/h.0/attn/c_attn/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Concat_1, /transformer/h.0/attn/c_attn/Constant_7" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/transformer/h.0/attn/c_attn/Concat_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/transformer/h.0/attn/c_attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/c_attn/Reshape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transformer/h.0/attn/c_attn/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_4611476" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="468676" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611476" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="97" name="/transformer/h.0/attn/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="468684" size="24" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/h.0/attn/Constant_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/transformer/h.0/attn/Split" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/Split" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/transformer/h.0/attn/Split_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="4" precision="FP32" names="/transformer/h.0/attn/Split_output_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="5" precision="FP32" names="/transformer/h.0/attn/Split_output_2">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/transformer/h.0/attn/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/Shape_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/h.0/attn/Shape_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/transformer/h.0/attn/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/h.0/attn/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="101" name="Constant_4611508" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611508" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="102" name="/transformer/h.0/attn/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/Constant_5, /transformer/h.0/attn/Gather_2, Constant_4611508" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transformer/h.0/attn/Gather_2_output_0" />
			</output>
		</layer>
		<layer id="103" name="Constant_155" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_155" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_210">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/transformer/h.0/attn/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/Unsqueeze_2, Constant_155" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transformer/h.0/attn/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/transformer/h.0/attn/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/Shape_3" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transformer/h.0/attn/Shape_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/transformer/h.0/attn/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390152" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/transformer/h.0/attn/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/transformer/h.0/attn/Constant_6_output_0" />
			</output>
		</layer>
		<layer id="107" name="Constant_4611512" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="390160" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4611512" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="108" name="/transformer/h.0/attn/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
